FocusGroup8/FocusLamp_DEMO2/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# end of Serial flasher config

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
# end of Partition Table

#
# Example Configuration
#
CONFIG_EXAMPLE_ENABLE_LED=y
CONFIG_EXAMPLE_ENABLE_TOUCH=y
CONFIG_EXAMPLE_ENABLE_CAMERA=y
CONFIG_EXAMPLE_DEMO_EXPRESSIVE_EYES=y
CONFIG_EXAMPLE_ENABLE_SYSMON=y
# end of Example Configuration

#
# Touch Interpreter
#
CONFIG_TOUCH_INTERPRETER_TAP_MIN_MS=150
CONFIG_TOUCH_INTERPRETER_TAP_MAX_MS=350
CONFIG_TOUCH_INTERPRETER_DOUBLE_TAP_MIN_MS=120
CONFIG_TOUCH_INTERPRETER_LONG_PRESS_MS=3000
CONFIG_TOUCH_INTERPRETER_VALID_TOUCH_MIN_MS=80
# end of Touch Interpreter

#
# WebSocket Manager Configuration
#
CONFIG_WS_MANAGER_BUFFER_SIZE=8192

#
# Client Configuration
#
CONFIG_WS_MANAGER_CLIENT_ENABLE=n
# end of Client Configuration

#
# Server Configuration
#
CONFIG_WS_MANAGER_SERVER_ECHO=n
# end of Server Configuration
# end of WebSocket Manager Configuration

#
# WiFi Manager Configuration
#
CONFIG_WIFI_MANAGER_SSID="RT3"
CONFIG_WIFI_MANAGER_PASSWORD="10101010"
# end of WiFi Manager Configuration

#
# Component config
#

#
# Hardware Settings
#

#
# Chip revision
#
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
# end of Chip revision
# end of Hardware Settings

#
# ESP PSRAM
#
CONFIG_SPIRAM=y

#
# PSRAM config
#
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=131072
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# end of PSRAM config
# end of ESP PSRAM

#
# ESP System Settings
#
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_MAIN_TASK_AFFINITY_NO_AFFINITY=y
# end of ESP System Settings

#
# Wi-Fi
#
CONFIG_ESP_HOST_WIFI_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=32
CONFIG_ESP_WIFI_RX_BA_WIN=32
CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=y
# end of Wi-Fi

#
# LWIP
#
CONFIG_LWIP_TCPIP_CORE_LOCKING=y
CONFIG_LWIP_TCPIP_CORE_LOCKING_INPUT=y
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_EXTRA_IRAM_OPTIMIZATION=y

#
# TCP
#
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=48
CONFIG_LWIP_TCP_SACK_OUT=y
# end of TCP

CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU1=y
# end of LWIP

#
# mbedTLS
#
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
# end of mbedTLS

#
# Espressif Camera Sensors Configurations
#

#
# Camera Sensor Configuration
#

#
# Select and Set Camera Sensor
#
CONFIG_CAMERA_OV5647=y

#
# Choose supported formats for MIPI CSI interface
#
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X640_50FPS=y
# end of Choose supported formats for MIPI CSI interface

CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW8_800X640_50FPS=y
# end of Select and Set Camera Sensor
# end of Camera Sensor Configuration
# end of Espressif Camera Sensors Configurations

#
# ESP-Hosted config
#

#
# Hosted SDIO Configuration
#
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=64
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=64
# end of Hosted SDIO Configuration

CONFIG_ESP_HOSTED_ENABLE_ITWT=n
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
# end of ESP-Hosted config

#
# Wi-Fi Remote
#
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C5=y

#
# Wi-Fi configuration
#
CONFIG_WIFI_RMT_RX_BA_WIN=32
# end of Wi-Fi configuration
# end of Wi-Fi Remote
# end of Component config

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
